Documents/УДАЛИТЬ_СервисныеЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_СервисныеЗаявки</Name>
			<BasedOn>
				<xr:Item>Document.Лид</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервиснаяБригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УДАЛИТЬ_СервисныеБригады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСервисныхЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УДАЛИТЬ_СервисныеЗаявки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
		
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьГрафик();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("Основание",Объект.Основание);
	СтруктураОповещения.Вставить("Ссылка",Объект.Ссылка);
	Оповестить("ЗакрытаФормаСервиснойЗаявки", СтруктураОповещения);
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресКлиента()
	Возврат Объект.Контрагент.ФактическийАдрес;
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Адрес = ПолучитьАдресКлиента();			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителейБригады()
	Объект.Исполнители.Очистить();
	Объект.Исполнители.Загрузить(Объект.СервиснаяБригада.Сотрудники.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура СервиснаяБригадаПриИзменении(Элемент)
	ЗаполнитьИсполнителейБригады();
КонецПроцедуры

&НаКлиенте
Процедура ДатаРаботПриИзменении(Элемент)
	СформироватьГрафик();
КонецПроцедуры

#Область ДляРисованияГрафика

&НаСервере
Функция СоединитьДатуИВремя(Дата, Время) 	
	ДатаСтрока = Формат(Дата, "ДФ=""ггггММдд""");
	ВремяСтрока = Формат(Время, "ДФ=""ЧЧммсс""");
	Рез = Дата(ДатаСтрока + ВремяСтрока);	
	Возврат Рез;	
КонецФункции

&НаСервере
Процедура СформироватьГрафик()
	СформироватьГрафикПоЗаявке();
	ДобавитьТекущуюЗаявкуВКалендарь();
КонецПроцедуры

&НаСервере
Процедура СформироватьГрафикПоЗаявке() 
	//// периоды отображения и время (часы) для отображения
	//ВремяНачала = Константы.НачалоРабочегоВремениМонтажей.Получить();
	//ВремяКонца  = Константы.КонецРабочегоВремениМонтажей.Получить();
	////ДлинаМонтажаПоУмолчанию = Константы.КоличествоЧасовНеобходимыхНаМонтаж.Получить()*60*60;
	//
	//ОтображаемаяДата = ?(ЗначениеЗаполнено(Объект.ДатаРабот), Объект.ДатаРабот, ТекущаяДата());
	//РезультатПланировщик.ТекущиеПериодыОтображения.Очистить();
	//РезультатПланировщик.ТекущиеПериодыОтображения.Добавить(СоединитьДатуИВремя(ОтображаемаяДата, ВремяНачала), 
	//														СоединитьДатуИВремя(ОтображаемаяДата, ВремяКонца) + 30*60);
	// 
	////добавляем бригады
	//РезультатПланировщик.Измерения.Очистить();
	//Бригады = РезультатПланировщик.Измерения.Добавить("СервиснаяБригада");
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	СервисныеБригады.Ссылка КАК Бригада
	//|ИЗ
	//|	Справочник.СервисныеБригады КАК СервисныеБригады
	//|ГДЕ
	//|	СервисныеБригады.ПометкаУдаления = Ложь";
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//Для Каждого ТекущийБригада Из РезультатЗапроса Цикл
	//	НовыйБригада = Бригады.Элементы.Добавить(ТекущийБригада.Бригада);
	//	НовыйБригада.Текст = ТекущийБригада.Бригада.Наименование;
	//	НовыйБригада.ЦветФона = WebЦвета.Белый;
	//КонецЦикла;
	//
	//// добавляем элементы
	//ЭлементыГрафика = РезультатПланировщик.Элементы;
	//ЭлементыГрафика.Очистить();
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	УДАЛИТЬ_СервисныеЗаявки.Ссылка,
	//|	УДАЛИТЬ_СервисныеЗаявки.СервиснаяБригада,
	//|	УДАЛИТЬ_СервисныеЗаявки.ДатаРабот,
	//|	УДАЛИТЬ_СервисныеЗаявки.ВремяНачалаРабот,
	//|	УДАЛИТЬ_СервисныеЗаявки.ВремяОкончанияРабот,
	//|   УДАЛИТЬ_СервисныеЗаявки.Контрагент,
	//|   УДАЛИТЬ_СервисныеЗаявки.Адрес
	//|ИЗ
	//|	Документ.УДАЛИТЬ_СервисныеЗаявки КАК УДАЛИТЬ_СервисныеЗаявки
	//|ГДЕ
	//|	УДАЛИТЬ_СервисныеЗаявки.ДатаРабот МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)";
	//Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(ОтображаемаяДата));
	//Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(ОтображаемаяДата));
	//Выборка = Запрос.Выполнить().Выбрать();
	//  
	//Пока Выборка.Следующий() Цикл
	//	Если  Выборка.Ссылка <> Объект.Ссылка Тогда
	//		// Связка записей с измерениями выполняется через соответствия
	//		СоответствиеЗначений = Новый Соответствие;
	//		СоответствиеЗначений.Вставить("СервиснаяБригада", Выборка.СервиснаяБригада);
	//		
	//		// Добавление новой записи в промежуток времени
	//		НовыйЭлемент = ЭлементыГрафика.Добавить(СоединитьДатуИВремя(Выборка.ДатаРабот , Выборка.ВремяНачалаРабот), СоединитьДатуИВремя(Выборка.ДатаРабот , Выборка.ВремяОкончанияРабот));
	//		НовыйЭлемент.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);
	//		НовыйЭлемент.Значение = Выборка.Ссылка;
	//		НовыйЭлемент.Текст    = Выборка.Контрагент.Наименование + " (" + Выборка.Адрес + ")";		
	//		НовыйЭлемент.ЦветФона = WebЦвета.Серый;
	//	КонецЕсли;
	//КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ДобавитьТекущуюЗаявкуВКалендарь()
	Если ЗначениеЗаполнено(Объект.ДатаРабот) И ЗначениеЗаполнено(Объект.ВремяНачалаРабот) Тогда	
		ЭлементыГрафика = РезультатПланировщик.Элементы;
		СоответствиеЗначений = Новый Соответствие;
		СоответствиеЗначений.Вставить("СервиснаяБригада", Объект.СервиснаяБригада);
		
		НовыйЭлемент = 
		ЭлементыГрафика.Добавить(СоединитьДатуИВремя(Объект.ДатаРабот , Объект.ВремяНачалаРабот), СоединитьДатуИВремя(Объект.ДатаРабот , Объект.ВремяОкончанияРабот));
		НовыйЭлемент.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);
		НовыйЭлемент.Значение = Неопределено;
		НовыйЭлемент.Текст    = Объект.Контрагент.Наименование + " (" + Объект.Адрес + ")";		
		НовыйЭлемент.ЦветФона = WebЦвета.СветлоЗеленый;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗапланироватьРаботуПоЗаявке(ВремяНачалаРаботы = Неопределено, ВремяОкончанияРаботы=Неопределено, БригадаРаботы=Неопределено)
	
	//ВремяНачала = Константы.НачалоРабочегоВремениМонтажей.Получить();
	//ВремяКонца  = Константы.КонецРабочегоВремениМонтажей.Получить();
	//КоличествоИНтервалов30минут = (Число(Формат(ВремяКонца,"ДФ=ЧЧ")) - Число(Формат(ВремяНачала,"ДФ=ЧЧ"))) * 2;
	//
	//ВыбраннаяБригада = БригадаРаботы;
	//ВыбранноеВремя = Дата(0001,01,01,Час(ВремяНачала),Минута(ВремяНачала),Секунда(ВремяНачала)); 
	//
	//
	////определяем можно ли добавить замер определеной длины в выбраннй интервал
	//ДлинаМонтажаПоУмолчаниюВЧасах = Константы.КоличествоЧасовНеобходимыхНаМонтаж.Получить();
	//ВремяОкончанияМонтажа = ВыбранноеВремя + (Дата(1,1,1,Цел(ДлинаМонтажаПоУмолчаниюВЧасах),(ДлинаМонтажаПоУмолчаниюВЧасах - Цел(ДлинаМонтажаПоУмолчаниюВЧасах))*60,0)-Дата(1,1,1,0,0,0));
	///
	вр_ВремяНачалаРаботы = Дата(0001,01,01, Час(ВремяНачалаРаботы), Минута(ВремяНачалаРаботы), Секунда(ВремяНачалаРаботы));
	вр_ВремяОкончанияРаботы = Дата(0001,01,01, Час(ВремяОкончанияРаботы), Минута(ВремяОкончанияРаботы), Секунда(ВремяОкончанияРаботы));
	
	ИнтервалСвободный = ПроверитьСвободныйИнтервал(Дата(ВремяНачалаРаботы), вр_ВремяНачалаРаботы, вр_ВремяОкончанияРаботы, БригадаРаботы);
	Если НЕ ИнтервалСвободный Тогда
		Сообщить("В выбранное время заявку добавить нельзя, т.к. периоды заявок пересекаются", СтатусСообщения.Важное);
		Возврат Ложь;
	Иначе
		Объект.СервиснаяБригада = БригадаРаботы;
		Объект.ДатаРабот = Дата(ВремяНачалаРаботы); 
		Объект.ВремяНачалаРабот = ВремяНачалаРаботы;
		Объект.ВремяОкончанияРабот = ВремяОкончанияРаботы;
		ЗаполнитьИсполнителейБригады();
		ЭтаФорма.Модифицированность = Истина;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьСвободныйИнтервал(Дата, ВремяНачала, ВремяОкончания, Бригада)
	ИнтервалСвободный = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УДАЛИТЬ_СервисныеЗаявки.Ссылка
	|ИЗ
	|	Документ.УДАЛИТЬ_СервисныеЗаявки КАК УДАЛИТЬ_СервисныеЗаявки
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(УДАЛИТЬ_СервисныеЗаявки.ДатаРабот, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И УДАЛИТЬ_СервисныеЗаявки.СервиснаяБригада = &Бригада
	|	И (УДАЛИТЬ_СервисныеЗаявки.ВремяНачалаРабот >= &ВремяНачала    ИЛИ УДАЛИТЬ_СервисныеЗаявки.ВремяОкончанияРабот >= &ВремяНачала)
	|	И (УДАЛИТЬ_СервисныеЗаявки.ВремяНачалаРабот <= &ВремяОкончания ИЛИ УДАЛИТЬ_СервисныеЗаявки.ВремяОкончанияРабот <= &ВремяОкончания)
	|	И УДАЛИТЬ_СервисныеЗаявки.Ссылка <> &Ссылка
	|";
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.УстановитьПараметр("Бригада",		Бригада);
	Запрос.УстановитьПараметр("ВремяНачала",	ВремяНачала + 1);
	Запрос.УстановитьПараметр("ВремяОкончания",	ВремяОкончания-1);
	Запрос.УстановитьПараметр("Ссылка", 		Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 тогда
		ИнтервалСвободный = Ложь;
	Иначе
		ИнтервалСвободный = Истина;
	КонецЕсли;
	
	Возврат ИнтервалСвободный;
	
КонецФункции

#КонецОбласти


#Область СобытияПланировщика

&НаКлиенте
Процедура РезультатПланировщикПриАктивизации(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикВыбор(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	Если НЕ НовыйЭлемент Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	Если ЗапланироватьРаботуПоЗаявке(Начало, Конец, Значения.Получить("СервиснаяБригада")) Тогда
		СформироватьГрафик();		
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	Если НЕ НовыйЭлемент Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	// например при прокрутке ролика мыши
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти
